
Page({

    /**
     * 页面的初始数据
     */
    data: {
        id:'0',
        plant_data1:[
            ['绿萝','泥炭土或配好的营养土，亦可水培养护','耐阴植物，放在明亮散射光处，冬季可照2-3h阳光','喜湿，看到盆土表面干燥时浇一次透水，可经常在叶片周围喷雾','把花肥按照使用说明稀释，平均每月施肥1次','及时剪除枯叶'],
            ['发财树','泥炭土、粗砂混合','喜阳，但耐阴性强，夏季放在半阴处养护','较耐旱，盆土干燥后浇一次透水，空气干燥时可以在周围喷水加湿','把花肥按照使用说明稀释，春秋生长季平均每月施肥1-2次','及时剪除枯叶和黄叶，萌发力强，可修剪至枝叶分明'],
            ['君子兰','泥炭土或配好的营养土','耐半阴，喜温和阳光，忌强光直射','耐旱，盆土干燥后浇一次透水','把花肥按照使用说明稀释，春秋生长季每月施肥1-2次，花期勿施','及时剪除枯叶、黄叶和残花'],
            ['红掌','泥炭土，盆土表面可覆盖一层水苔进行保湿','喜温和光照，耐半阴','喜湿，盆土干燥后浇一次透水，可向周围空气、浇水叶片喷水；冬天控水，保持盆土微湿即可','把花肥按照使用说明稀释，平均每月施肥1-2次','及时剪除烂根、老病叶、枯叶'],
            ['吊兰','泥炭土、粗砂混合','耐阴，喜欢半阴的环境，冬季可见阳光，叶色靓丽','喜欢湿润的环境，空气干燥时经常向周围喷水保浇水湿，冬季控制浇水','把花肥按照使用说明稀释，春秋季每隔10-15天施肥一次','及时剪除枯叶和黄叶'],
            ['文竹','泥炭土：粗砂=3:1混合','耐阴，放在散射光处养护','等土壤半干时浇一次浇水，忌盆土积水；冬季尽量偏干','喜薄肥，春秋生长季每月施肥1-2次；夏季高温施肥和花期勿施肥','及时剪除枯叶和黄叶；枝条过长时应及时搭架造剪枝型；1-2年换盆一次'],
            ['茉莉花','泥炭土或配好的营养土','喜阳光充足通风良好的地方，夏季强光需要适当遮蔽，花期放于散射光处','不耐旱，盆土表面干燥后浇一次透水，冬季休眠期控水','把花肥按照使用说明稀释，春夏生长季每月施肥1-2次','及时剪除枯叶、黄叶、残花以及过密枝条'],
            ['紫檀','对土壤要求不严','喜阳光充足的地方','土壤干燥后浇一次透水','基肥充足即可','及时剪除病枝、枯枝、黄叶'],
            ['幸福树','泥炭土或配好的营养土','喜半阴，光照温和时可晒2-3h阳光','喜湿润，土壤表面干燥时浇一次透水，忌积水施肥','把花肥按照使用说明稀释，平均每月施肥1-2次剪枝','及时剪除衰老部分，枯枝和病虫枝'],
            ['虎尾兰','对土壤要求不严，以砂质壤土为宜','耐半阴，喜温和阳光，忌强光直射，不能长期过阴养护','耐旱，盆土干燥后浇一次透水，冬季休眠控水','把花肥按照使用说明稀释，春秋生长季每月施肥施肥1次，冬季休眠期停止','及时剪除枯叶、黄叶和病叶'],
            ['栀子花','泥炭土或配好的营养土','喜欢充足的日照，也耐半阴，忌强光照射，花期放于散射光处','喜湿，看到盆土表面干燥时浇一次透水，冬季控浇水','除了基肥外，春季生长季每月施液体肥1-2次，为了防止黄化，可每月叶面喷洒硫酸亚铁','及时剪除枯叶、黄叶、残花以及过密枝条'],
            ['月季','泥炭土或配好的营养土','喜欢晒太阳，放在光照充足的地方，但要避免夏季中午强日照','看到盆土表面干燥时浇一次透水，冬季注意控水','把花肥按照使用说明稀释，平均每月施肥2-3次','及时剪除老叶、病叶和枯叶；开花后在盆土上10厘米处短截，留三到五片叶子'],
            ['一帆风顺','泥炭土，盆土表面可覆盖一层水苔进行保湿','喜半阴，宜放于明亮散射光处养护','喜湿，盆土干燥后立即浇一次透水，可向周围空气、叶片喷水；冬天控水','把花肥按照使用说明稀释，平均每月施液肥1-2施肥','及时剪除烂根、老病叶、枯叶'],
            ['玫瑰','泥炭土或配好的营养土','喜欢晒太阳，放在光照充足的地方，但要避免夏季中午强日照','看到盆土表面干燥时浇一次透水，忌积水','把花肥按照使用说明稀释，平均每月施肥2-3次','及时剪除老叶、病叶和枯叶；开花后在盆土以上5厘米处短截，留两到三片叶子'],
            ['金钱树','泥炭土或配好的营养土','喜半阴，光照温和时可晒3-4h阳光','耐旱，土壤表面干燥时浇一次透水，忌积水','把花肥按照使用说明稀释，平均每月施1-2次','及时剪除衰老部分，黄叶和烂叶'],
            ['长寿花','泥炭土：珍珠岩=4:1的混合土','喜欢日照，夏季中午强光适当遮蔽，每天照射约4-6小时','耐干旱，夏季通常4-5天浇一次透水；冬季通常8-10天浇一次透水','把花肥按照使用说明稀释，平均每月施肥1-2次','剪除病叶，黄叶，垂叶，摘心1-2次，促分枝'],
            ['蟹爪兰','泥炭土、粗砂混合','半阴性植物，喜温和的阳光，夏季半休眠，需遮阴','耐旱，当盆土表面干燥时浇一次透水，夏季半休眠期和冬季花期少浇水','把花肥按照使用说明稀释，春秋生长季每月施肥1-2次，花期和夏季半休眠期勿施','花谢后，及时从残花下的2-3片茎节处短截阴'],
            ['兰花','椰子壳、树皮或水苔等疏松透气的植料','喜半阴环境，秋冬日照温和时可晒2-3小时阳光，叶子暗绿需增加光照','盆土表面干燥后浇一次透水，夏季可向周围空气喷雾，冬季休眠期少量浇水','春秋生长季每隔10-15天施肥一次，叶面喷雾和土壤施肥均可，阴雨天和气温低于10℃以下勿施','剪去残花、病叶；开花后剪掉花梗'],
            ['茶花','喜酸性土壤，泥炭土或配好的营养土','喜半阴环境，春秋季放温和日照处，冬季可全日照养护','不耐旱，盆土表面干燥后浇一次透水','把花肥按照使用说明稀释，春秋生长季每月施肥1-2次，花期不用施','及时剪除枯叶、黄叶和残花'],
            ['薄荷','泥炭土或配好的营养土','长日照植物，喜日照充足的地方，夏季中午适当遮阴','不耐旱，盆土发白及时浇透水，夏季每天浇水，其他季节可2-3天浇一次透水','喜肥，以氮肥为主，每隔10天施液体肥一次','及时剪除老病叶、枯叶'],
        ],
        plant_data2:['名称','土壤','光照','浇水','施肥','剪枝'],
        plant_data3:['https://z3.ax1x.com/2021/08/30/htuRGd.jpg','https://z3.ax1x.com/2021/08/30/htKUw8.jpg','https://z3.ax1x.com/2021/08/30/htXlpd.jpg','https://z3.ax1x.com/2021/08/30/htX5cR.jpg','https://z3.ax1x.com/2021/08/30/htXxgA.jpg','https://z3.ax1x.com/2021/08/30/htjiE8.jpg','https://z3.ax1x.com/2021/08/30/htjKbV.jpg','https://z3.ax1x.com/2021/08/30/htjYvR.jpg','https://z3.ax1x.com/2021/08/30/htj0UO.jpg','https://z3.ax1x.com/2021/08/30/hN9puj.jpg','https://z3.ax1x.com/2021/08/30/hNCQyQ.jpg','https://z3.ax1x.com/2021/08/30/hNP6Bj.jpg','https://z3.ax1x.com/2021/08/30/hNiV8f.jpg','https://z3.ax1x.com/2021/08/30/hNiaqJ.jpg','https://z3.ax1x.com/2021/08/30/hNisG6.jpg','https://z3.ax1x.com/2021/08/30/hNigMD.jpg','https://z3.ax1x.com/2021/08/30/hNFMQO.jpg','https://z3.ax1x.com/2021/08/30/hNF3eH.jpg','https://z3.ax1x.com/2021/08/30/hNFtYt.jpg','https://z3.ax1x.com/2021/08/30/hNFw6S.jpg']
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function (options) {
        var id = options.id
        this.setData({
          id: id
    })

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function () {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function () {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function () {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function () {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function () {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function () {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function () {

    }
})